HELLO_TEXT = "Привет! Вы запустили навык НАЗВАНИЕ-В-РАЗРАБОТКЕ. " \
             "Задача этого навыка - помочь вам отслеживать " \
             "свою активность в течение дня."

ABOUT_TEXT = "Сколько времени вы потратили на занятия спортом или простую прогулку? " \
             "А на готовку? Возможно, Вы хотели бы узнать, сколько времени " \
             "тратите на игры или просмотр любимых блогеров на YouTube?\n\n" \
             "С помощью этого навыка Вы сможете в любой момент запросить " \
             "свою статистику в виде текста и красивой визуализации, " \
             "которая поможет точнее оценить ваше распределение времени " \
             "в течение дня и целой недели. О чём вы хотите узнать?"
