WHAT_YOU_CAN_ACTIVITIES = (
    'Первое, что я могу - это отслеживать активности. '
    'Если вы захотите начать отслеживать активность - просто перейдите в раздел "Активности" и скажите, '
    'какую активность вы хотите начать. Когда закончите - снова зайдите в раздел активностей и мы завершим '
    'активность. Продолжим?'
)
WHAT_YOU_CAN_STATISTIC = (
    'Как только у вас появится первая активность, Вы сможете узнать свою статистику в одноимённом '
    'разделе. В разделе статистика Вы сможете посмотреть как и на записи активностей, как за сегодня, '
    'так и за последнюю неделю. Если хотите прослушать информацию о навыке ещё раз - скажите "Повторить". '
    'Чтобы вернуться в главное меню - скажите "Главно меню".'
)


HELLO_TEXT_NEW = "Привет! Вы запустили навык \"Временной помощник\". " \
                 "Задача этого навыка - помочь вам отслеживать " \
                 "свою активность в течение дня. Начнём?"

HELLO_TEXT_STD = [
    "Хотите начать активность или узнать статистику?",
    "Если хотите начать активность или посмотреть статистику - просто скажите!",
    "Начать отслеживать активность или показать вам статистику?"
]

ACTIVITIES_RAND = [
    "Чему уделим время в этот раз?",
    "Проведём время с пользой!",
    "Трудимся или веселимся?"
]

MAIN_MENU = "Хотите начать отслеживать активность или посмотреть статистику?"

ACTIVITIES = " Вы можете начать отслеживать следующие виды активностей: Работа, Домашние " \
             "Дела, Хобби, Спорт, Прочее. Назовите вид активности, а всё остальное сделаю я!"

ABOUT_ACTIVITIES = (
    'Активности представляют собой записи о Ваших действиях в течение дня. Существует несколько видов '
    'активностей: "Работа", "Домашние Дела", "Хобби", "Спорт", "Прочее". Начав отслеживать '
    'активность, Вы можете добавить произвольный текст к её описанию. Оговоримся, что активности, '
    'на которые Вы тратите мало времени в течение дня, лучше отмечать в разделе "Прочее", '
    'а Активности, продолжительность которых меньше минуты, будут проигнорированы. '
    'Так, Ваша статистика будет составлена точнее, а значит станет полезнее для Вас! Хотите '
    'узнать о навыке и статистике? Или же вернёмся в главное меню?'
)

ABOUT_STATISTIC = (
    'Наверняка вам захочется посмотреть на результаты ваших трудов, поэтому спешим вас обрадовать: Вы ' 
    'можете узнать свою статистику за сегодняшний и предыдущие дни!' 
    'Хотите узнать о навыке и активностях? Или же вернёмся в главное меню?'
)

COMMAND_NOT_FOUND = "Извините, я не знаю такой команды. Вы хотите добавить активность, " \
                    "узнать свою статистику или вам нужна помощь?"

TEXTS = {
    'hello_new': HELLO_TEXT_NEW,
    'hello_std': HELLO_TEXT_STD,
    'main_menu': MAIN_MENU,
    'what_you_can': None,
    'what_you_can_activities': WHAT_YOU_CAN_ACTIVITIES,
    'what_you_can_statistic': WHAT_YOU_CAN_STATISTIC,
    'activities': ACTIVITIES,
    'activities_rand': ACTIVITIES_RAND,
    'about_activities': ABOUT_ACTIVITIES,
    'about_statistic': ABOUT_STATISTIC,
    'command_not_found': COMMAND_NOT_FOUND
}

