HELLO_TEXT_NEW = "Привет! Вы запустили навык \"Контроль Времени\". " \
                 "Задача этого навыка - помочь вам отслеживать " \
                 "свою активность в течение дня. Начнём?"

HELLO_TEXT_STD = [
    "Привет! Хотите начать активность или узнать статистику?",
    "Привет! Если хотите начать активность или посмотреть статистику - просто скажите!",
    "Привет! Начать отслеживать активность или показать вам статистику?"
]

MAIN_MENU = "Хотите начать отслеживать активность или посмотреть статистику?"

ACTIVITIES = "Вы можете начать отслеживать следующие виды активностей: Работа, Домашние " \
             "Дела, Хобби, Спорт, Прочее. Назовите вид активности, а всё остальное сделаю я!"

GENERAL_HELP = "Нужна моя помощь? Я могу рассказать Вам о навыке, активностях или статистике. " \
               "О чём именно вы хотите узнать?"

ABOUT_SKILL = (
    'Рассказываю: этот навык призван помочь Вам следить за тем, как Вы распределяете своё время. Если Вы активная '
    'личность, дорожащая каждой минутой и желающая оценить свои временные затраты - Контроль Времени '
    'обязательно поможет Вам в этом деле. В разделе "Активности" Вы сможете делать отметки о начале и конце '
    'ваших активностей, а раздел "Статистика" предоставит Вам краткую информацию о Ваших активностях в виде '
    'текста и круговой диаграммы. Скажите, если хотите узнать подробнее о статистике и активностях. Или же '
    'вернёмся в главное меню?'
)

ABOUT_ACTIVITIES = (
    'Рассказываю: Активности представляют собой записи о Ваших действиях в течение дня. Существует несколько видов '
    'Активностей: работа, хобби, домашние дела, сон, спорт, отдых, прочее. Начав отслеживать ' 
    'Активность, Вы можете добавить произвольный текст к её описанию. Оговоримся, что Активности, ' 
    'на которые Вы тратите мало времени в течение дня, лучше отмечать в разделе Прочее. Так, ' 
    'Ваша статистика будет составлена точнее, а значит станет полезнее для Вас! Хотите ' 
    'узнать о навыке и статистике? Или же вернёмся в главное меню?'
)

ABOUT_STATISTIC = 'Наверняка вам захочется посмотреть на результаты ваших трудов, поэтому спешим вас обрадовать: Вы ' \
                  'можете узнать свою статистику за сегодняшний и предыдущие дни! Кроме того, что Вы сможете ' \
                  'посмотреть на неё в виде текстовых записей, мы добавим визуализацию в виде круговой диаграммы. ' \
                  'Хотите узнать о навыке и активностях? Или же вернёмся в главное меню?'

COMMAND_NOT_FOUND = "Извините, я не знаю такой команды. Вы хотите добавить активность, " \
                    "узнать свою статистику или вам нужна помощь?"

TEXTS = {
    'hello_new': HELLO_TEXT_NEW,
    'hello_std': HELLO_TEXT_STD,
    'main_menu': MAIN_MENU,
    'activities': ACTIVITIES,
    'help': GENERAL_HELP,
    'about_skill': ABOUT_SKILL,
    'about_activities': ABOUT_ACTIVITIES,
    'about_statistic': ABOUT_STATISTIC,
    'command_not_found': COMMAND_NOT_FOUND
}
