HELLO_TEXT_NEW = "Привет! Вы запустили навык \"Контроль Времени\". " \
                 "Задача этого навыка - помочь вам отслеживать " \
                 "свою активность в течение дня. Начнём?"

HELLO_TEXT_STD = [
    "Привет! Хотите начать активность или узнать статистику?",
    "Привет! Если хотите начать активность или посмотреть статистику - просто скажите!",
    "Привет! Начать отслеживать активность или показать вам статистику?"
]

MAIN_MENU = "Хотите начать отслеживать активность или посмотреть статистику?"

ACTIVITIES = "Вы можете начать отслеживать следующие виды активностей: Работа, Домашние " \
             "Дела, Хобби, Спорт, Прочее. Назовите вид активности, а всё остальное сделаю я!"

GENERAL_HELP = "Я могу рассказать вам о навыке, активностях или статистике. " \
               "О чём именно вы хотите узнать?"

ABOUT_SKILL = "Этот навык призван помочь Вам следить за тем, как вы распределяете " \
              "своё время. Если Вы активная личность, дорожащая каждой минутой и " \
              "желающая оценить свои времязатраты - Контроль Времени обязательно поможет " \
              "вам в этом деле. В разделе \"Активности\" вы сможете делать отметки о начале " \
              "и конце занятий, а раздел \"Статистика\" предоставить вам краткую информацию " \
              "о ваших активностях в виде текста, но не ограниваясь им. Скажите, если хотите " \
              "узнать подробнее о статистике и активностях. Или же вернёмся в главное меню?"

ABOUT_ACTIVITIES = "Активности представляют собой записи о Ваших действиях " \
                   "в течение дня. Существует несколько типов Активностей: " \
                   "работа, хобби, домашние дела, сон, спорт, отдых, прочее. В каждом " \
                   "разделе Активностей есть 4 подраздела, которые Вы можете " \
                   "настроить по своему усмотрению. Оговоримся, что Активности, " \
                   "на которые вы тратите мало времени в течение дня, лучше отмечать " \
                   "в разделе Прочее. Так, ваша итоговая статистика будет составлена " \
                   "точнее, а значит и рекомендации станут полезнее. Хотите узнать " \
                   "о чём-то ещё или вернёмся в главное меню?"

ABOUT_STATISTIC = "Наверняка вам захочется посмотреть на распределение своего времени, " \
                  "поэтому спешим вас обрадовать: Вы можете узнать свою статистику за " \
                  "день, либо же целую неделю. Кроме того, что Вы сможете посмотреть на " \
                  "неё в виде текстовых записей прямо в навыке, Вам предоставляется " \
                  "возможность взглянуть на результаты своих трудов в виде визуализации " \
                  "на отдельной страничке, сгенерированной специально для вас. А если " \
                  "ваши активности в сумме будут составлять хотя бы 4 часа, то навык " \
                  "даже сможет дать краткую оценку вашей Статистике, предложив несколько " \
                  "рекомендаций. Хотите узнать о чём-то ещё или вернёмся в главное меню?"

COMMAND_NOT_FOUND = "Извините, я не знаю такой команды. Вы хотите добавить активность, " \
                    "узнать свою статистику или вам нужна помощь?"

TEXTS = {
    'hello_new': HELLO_TEXT_NEW,
    'hello_std': HELLO_TEXT_STD,
    'main_menu': MAIN_MENU,
    'activities': ACTIVITIES,
    'help': GENERAL_HELP,
    'about_skill': ABOUT_SKILL,
    'about_activities': ABOUT_ACTIVITIES,
    'about_statistic': ABOUT_STATISTIC,
    'command_not_found': COMMAND_NOT_FOUND
}
